read_verilog StructuralDescription.v
hierarchy -check -top binaryToESeg

show -notitle -stretch -format pdf -prefix StruturalSynthesis